#include <stdint.h>      // Написать только одну функцию, которая определяет, верно ли, что среди элементов массива есть два одинаковых.
#include <stdio.h>       //  Если ответ «да», функция возвращает 1; если ответ «нет», то 0. Строго согласно прототипу:
#include <inttypes.h>    // int is_two_same(int size, int a[]);
#include <string.h>

//--------------------------------------------------------------------------
int is_two_same(int size, int *arr_s)        // функция заданная условием задачи
{
    int n_two, i, j ;

    for ( i = 0; i < size-1; i++)
    {
        n_two = 1;
        for ( j = i+1; j < size; j++)
            n_two += ( *(arr_s+i) == *(arr_s+j) ) ? 1 : 0 ;
            
        //printf(" / i = %d    n_two = %d / ", i, n_two);
        if( n_two == 2 ) return 1;
    }    
    return 0 ;
}
//--------------------------------------------------------------------------
/*
int64_t main()               
{    
    int arr_S[100]={773, 307, 371, 548, 531, 765, 402,  27, 573, 591, 217, 859, 662, 493, 173, 174, 125, 591, 324, 231, 130, 394, 573,   3, 190,
                     65, 570, 258, 343,   3, 586,  14, 785, 296, 140, 726, 598, 262, 807, 794, 510, 465,  66, 895, 182, 218, 302,  34, 205, 399,
                    252, 687, 660, 952, 737,  32, 310, 680,  36, 139, 346, 139, 489, 217, 767, 544, 158, 774, 883, 154, 802, 136, 842, 769,   3,
                    569, 377, 867, 423, 224, 176, 118, 660, 513, 734,  45, 978, 983, 749, 909, 601, 270, 147, 433, 737, 789, 304, 815, 503,  111};
    int size_arr = 100 ;    



    printf("%d", is_two_same(size_arr, arr_S) );

    return 0;
}
*/