#include <stdint.h>   // Составить функцию которая определяет в массиве, состоящем из положительных и отрицательных чисел, 
#include <stdio.h>    // сколько элементов превосходят по модулю максимальный элемент. Прототип функции
#include <inttypes.h> // int count_bigger_abs(int n, int a[]); Например, на отрезке [4, 6]
#include <string.h>   // в массиве 1 2 3 4 5 6 7 8 9 10 функция вернет 3 значения 

//---------------------------------------------------------------------------------------
int my_Abs(int num) // получение числа по модулю
{
    return (num < 0) ? -num : num;
}

//--------------------------------------------------------------------------------
int count_bigger_abs(int size, int *arr)    // Функция заданная условием задачи
{
    int i = 0, j = 0, rez =0, max_el = *arr ;

    for ( i = 1; i < size; i++)
        max_el = (max_el < *(arr + i)) ? *(arr + i) : max_el ;  // поиск максимально значения в массиве

    for ( i = 0; i < size; i++)
        if( my_Abs(max_el) < my_Abs( *(arr + i) ) )
           rez++ ;
    
    return rez ;
}

/*
int main()  //  80 89 77 81 2 88 57 64 49 33 28 58         60 50 89 71 6 40 61 75 53 64 79 97
{ //            1 -20 3 4 -50 6 7 8 9 10
  //  -10 25 -20 25 -11 -32 -5 3 3 -34 -12 36 37 2 8 49 30 30 -12 14 -40 -24 40 -27 3 49 13 44 -33 2

    int size_arr = 10 ; // SIZE_ARR;
    int arr_S[10] = { 1, -20, 3, 4, -50, 6, 7, 8, 9, 10};
    int rez = 0 ;                           

    rez = count_bigger_abs( size_arr,  arr_S) ;         // Функция заданная условием задачи

    printf(" %d ", rez );
    

    return 0;
}
*/
