
#include <stdint.h>   // Дана целочисленная квадратная матрица 10 х 10. реализовать алгоритм вычисления 
#include <stdio.h>    //  суммы максимальных элементов из каждой строки. Напечатать значение этой суммы. 
#include <inttypes.h> // Предполагается, что в каждой строке такой элемент единственный.
#include <string.h>   // Реализовать функцию поиска максимума в строке из 10 элементов

#define RIGHT_SHIFT_FOR_INT64_t 31    // количество сдвигаемых разрядов для int
#define ARR_SIZE 10

//---------------------------------------------------------------------------------------
int64_t num_Znak(int64_t num) // знак числа, отрицательное или положительное
{
    int64_t maska_num_1 = 1;
    num = num >> RIGHT_SHIFT_FOR_INT64_t; // смещение старшего разряда в младший разряд, если он "1", число отрицательное

    return maska_num_1 & num; // побитовое умножение для проверки знака
}

//--------------------------------------------------------------------------------
int64_t main()  //  
{ 
    uint64_t size_arr = ARR_SIZE,    i = 0,  j = 0 ;
    int64_t arr_S[ARR_SIZE][ARR_SIZE] = {0}, sum_ob = 0, max_in_row = 0, prom = 0 ;

    for(i=0; i < size_arr; i++)
        for ( j = 0; j < size_arr; j++)
            scanf("%d", &arr_S[i][j]) ;                           //  
                                                                  //
    for(i=0; i < size_arr; i++)                                   //
    {                                                             // 
        max_in_row = arr_S[i][0] ;                                //
        for ( j = 1; j < size_arr; j++)                           //
        {                                                         //
            if( num_Znak(max_in_row) && num_Znak(arr_S[i][j]) )   // если оба сравниваемых числа отрицательные
            { 
                if( -max_in_row > -arr_S[i][j] )              //
                    max_in_row = arr_S[i][j] ;                    //
            }
            else 
            {        
                if( num_Znak(max_in_row) || num_Znak(arr_S[i][j]) )  //  если oдно отрицательное другое положительное
                {    
                    if( num_Znak(max_in_row) )
                        max_in_row = arr_S[i][j] ;                    //
                }
                else
                {                                        //  
                    if( max_in_row < arr_S[i][j] )                    // если оба числа положительные
                        max_in_row = arr_S[i][j] ; 
                }        
            }
        }  //  for j   
    //    printf("max_in_row = %d\n", max_in_row);                                           //
        sum_ob += max_in_row ;                                   //
    } // for i                                                   //
                                                                 // 
    printf("%d", sum_ob);

    return 0;
}

/*

 61 75 55 2 35 34 77 93 28 49  11 34 22 78 19 14 67 67 11 0  72 39 23 53 92 51 60 34 71 63  14 27 72 6 0 79 98 56 30 15
 31 16 3 4 95 59 25 17 11 20   5 93 21 61 96 30 79 38 73 40  89 4 66 19 36 99 67 67 92 36   87 54 7 35 40 43 44 46 4 69
 98 57 20 75 9 66 85 9 39 31   8 90 94 25 12 30 18 10 23 15

-47 19 8 -41 24 22 44 23 28 -29 
7 -14 -11 -20 -9 41 -9 -9 7 22 
46 15 -14 -37 -33 -42 4 -36 23 35 
-36 -2 47 11 22 33 34 12 -28 -50 
36 16 -24 35 -33 32 -45 31 31 -29 
-27 20 -28 -19 -40 -27 32 29 21 8 
36 9 -31 19 10 26 -15 -35 28 -16 
-16 -4 20 28 39 -17 -10 12 -31 -2 
3 24 -3 43 -21 -2 -23 -5 13 34 
-8 -16 -20 26 -14 41 23 47 -46 35

*/
